tutorials/crossFlowTurbineALST01/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
        name 	turbine;
        type	cellSet;
        action	new;
        source	cylinderToCell;
        sourceInfo
        {
            type cylinder;
            p1 (0 -0.358 -0.47);
            p2 (0 -0.358 0.47);
            radius 0.30;
        }
    }

    {
        name    turbine;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set turbine;
        }
    }

    {
        name 	turbine2;
        type	cellSet;
        action	new;
        source	cylinderToCell;
        sourceInfo
        {
            type cylinder;
            p1 (0 0.358 -0.47);
            p2 (0 0.358 0.47);
            radius 0.30;
        }
    }

    {
        name    turbine2;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set turbine2;
        }
    }
);

// ************************************************************************* //
